In [2]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sshtunnel import SSHTunnelForwarder

Topic:        Challenge Set 9
Subject:      SQL
Date:         11/1/2018
Name:         Spencer Tollefson
Worked with:  Leo, Anjali, Shweta, Hiranya

# w3 School Intro Questions - Part i

1.
SELECT * FROM CUSTOMERS
WHERE Country='UK';

2.
SELECT Orders.CustomerID, CustomerName, COUNT(*) AS Cnt from Orders
Join Customers ON Orders.CustomerID = Customers.CustomerID
Group by Customers.CustomerID
Order by Cnt DESC;

3.
Select Products.SupplierID, SupplierName, AVG(Price) from Products
JOIN Suppliers ON Suppliers.SupplierID = Products.SupplierID
Group By Suppliers.SupplierID
Order By AVG(Price) DESC;

4.
SELECT COUNT(DISTINCT(Country)) FROM CUSTOMERS

5.
SELECT CategoryName, COUNT(Categories.CategoryID) as CNT
FROM Products
 	JOIN Orderdetails ON Products.ProductID = Orderdetails.ProductID
    JOIN Categories ON Products.CategoryID = Categories.CategoryID
Group By Categories.CategoryID
Order By CNT Desc;

6.
SELECT OrderID, Orderdetails.Quantity AS Cost
FROM Products
	Join Orderdetails ON Orderdetails.ProductID = Products.ProductID
GROUP BY OrderID
Order By Cost DESC;

7.
SELECT e.FirstName, e.LastName, SUM(p.Price * op.Quantity) as Total
FROM Employees as e
	Join Orders as o
    Join OrderDetails as op
    Join Products as p
    On
    	e.EmployeeID = o.EmployeeID
        AND
        o.OrderID = op.OrderID
        AND
        op.ProductID = p.ProductID
Group By e.EmployeeID
Order By
	Total DESC;

8.
SELECT e.FirstName, e.LastName, e.Notes
FROM 
	Employees as e
WHERE
	e.Notes LIKE '%BS%'

9.
SELECT AVG(p.Price) as AvgPrice, SupplierName, Count(*) as NumProducts
FROM Products as p
	JOIN Suppliers AS s
		ON 
        p.SupplierID = s.SupplierID
GROUP BY s.SupplierID
HAVING NumProducts >= 3
ORDER BY AvgPrice DESC;

# Baseball Questions - Part ii

In [286]:
from sshtunnel import SSHTunnelForwarder

AWS_IP_ADDRESS = '54.245.34.41'
AWS_USERNAME = 'spencer'
SSH_KEY_PATH = '/home/spencer/.ssh/id_rsa'

server = SSHTunnelForwarder(
    AWS_IP_ADDRESS,
    ssh_username=AWS_USERNAME,
    ssh_pkey=SSH_KEY_PATH,
    remote_bind_address=('localhost', 5432),
)

server.start()
print(server.is_active, server.is_alive, server.local_bind_port)

True True 39433

In [287]:
from sqlalchemy import create_engine

# Postgres username, password, and database name
POSTGRES_IP_ADDRESS = 'localhost' ## This is localhost because SSH tunnel is active
POSTGRES_PORT = str(server.local_bind_port)
POSTGRES_USERNAME = 'spencer'     ## CHANGE THIS TO YOUR POSTGRES USERNAME
POSTGRES_PASSWORD = 'spencer' ## CHANGE THIS TO YOUR POSTGRES PASSWORD
POSTGRES_DBNAME = 'baseball'

# A long string that contains the necessary Postgres login information
postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
                .format(username=POSTGRES_USERNAME, 
                        password=POSTGRES_PASSWORD,
                        ipaddress=POSTGRES_IP_ADDRESS,
                        port=POSTGRES_PORT,
                        dbname=POSTGRES_DBNAME))

# Create the connection
cnx = create_engine(postgres_str)

1. What was the total spent on salaries by each team, each year?

In [406]:
sql_query = '''SELECT teamid, yearid, SUM(salary) AS totalspent
               FROM salaries
               GROUP BY teamid, yearid
               ORDER BY teamid ASC, yearid ASC
               LIMIT 10;'''

pd.read_sql_query(sql_query, cnx)

  teamid  yearid   totalspent
0    ANA    1997   31135472.0
1    ANA    1998   41281000.0
2    ANA    1999   55388166.0
3    ANA    2000   51464167.0
4    ANA    2001   47535167.0
5    ANA    2002   61721667.0
6    ANA    2003   79031667.0
7    ANA    2004  100534667.0
8    ARI    1998   32347000.0
9    ARI    1999   68703999.0

2. What is the first and last year played for each player? *Hint:* Create a new table from 'Fielding.csv'.

In [297]:
sql_query = '''SELECT playerID, MIN(yearID), MAX(yearID)
               FROM fielding
               GROUP BY playerID
               ORDER BY playerID
               LIMIT 10;'''

pd.read_sql_query(sql_query, cnx)

    playerid   min   max
0  aardsda01  2004  2013
1  aaronha01  1954  1976
2  aaronto01  1962  1971
3   aasedo01  1977  1990
4   abadan01  2001  2003
5   abadfe01  2010  2013
6  abadijo01  1875  1875
7  abbated01  1897  1910
8  abbeybe01  1892  1896
9  abbeych01  1893  1897

3. Who has played the most all star games?

In [298]:
sql_query = ''' SELECT playerid, COUNT(gp) AS gamesplayed
                FROM allstarfull
                GROUP BY playerID
                ORDER BY gamesplayed DESC
                LIMIT 1;'''

pd.read_sql_query(sql_query, cnx)

    playerid  gamesplayed
0  aaronha01           25

4. Which school has generated the most distinct players? *Hint:* Create new table from 'CollegePlaying.csv'.

In [300]:
sql_query = ''' SELECT *
                FROM schoolsplayers
                LIMIT 3;'''

pd.read_sql_query(sql_query, cnx)

    playerid schoolid
0  aardsda01   pennst
1  aardsda01     rice
2  abbeybe01  vermont

In [311]:
sql_query = ''' SELECT COUNT(DISTINCT(playerid)) AS PlayerCount, schoolname AS School
                FROM schools as s
                JOIN schoolsplayers as p
                ON s.schoolid = p.schoolid
                GROUP BY School
                ORDER BY PlayerCount DESC
                LIMIT 10;'''

pd.read_sql_query(sql_query, cnx)

   playercount                                      school
0          102           University of Southern California
1          100               University of Texas at Austin
2           98                    Arizona State University
3           82                         Stanford University
4           77                      University of Michigan
5           75                   College of the Holy Cross
6           70                    University of Notre Dame
7           68  University of Illinois at Urbana-Champaign
8           66                       University of Arizona
9           66       University of California, Los Angeles

5. Which players have the longest career? Assume that the `debut` and `finalGame` columns comprise the start and end, respectively, of a player's career. *Hint:* Create a new table from 'Master.csv'. Also note that strings can be converted to dates using the [`DATE`](https://wiki.postgresql.org/wiki/Working_with_Dates_and_Times_in_PostgreSQL#WORKING_with_DATETIME.2C_DATE.2C_and_INTERVAL_VALUES) function and can then be subtracted from each other yielding their difference in days.

In [331]:
sql_query = ''' SELECT namefirst, namelast, (finalgame - debut) AS daysplayed
                FROM master
                WHERE finalgame = finalgame AND debut = debut
                ORDER BY daysplayed DESC
                LIMIT 9
                ;'''

pd.read_sql_query(sql_query, cnx)

  namefirst  namelast  daysplayed
0      Nick   Altrock       12862
1       Jim  O'Rourke       11836
2    Minnie    Minoso       11492
3   Charley   O'Leary       11126
4     Arlie    Latham       10678
5    Deacon   McGuire       10192
6    Hughie  Jennings        9954
7    Johnny     Evers        9897
8     Nolan      Ryan        9873

6. What is the distribution of debut months? *Hint:* Look at the `DATE` and [`EXTRACT`](https://www.postgresql.org/docs/current/static/functions-datetime.html#FUNCTIONS-DATETIME-EXTRACT) functions.

In [374]:
sql_query = ''' SELECT month, COUNT(month)
                FROM (SELECT EXTRACT(MONTH FROM DEBUT) AS month FROM master) AS debutmonth
                GROUP BY month
                ORDER BY month
                LIMIT 8
                ;'''

pd.read_sql_query(sql_query, cnx)

   month  count
0    3.0     41
1    4.0   4711
2    5.0   2230
3    6.0   1893
4    7.0   1978
5    8.0   1943
6    9.0   5061
7   10.0    308

7. What is the effect of table join order on mean salary for the players listed in the main (master) table? *Hint:* Perform two different queries, one that joins on playerID in the salary table and other that joins on the same column in the master table. You will have to use left joins for each since right joins are not currently supported with SQLalchemy.

In [405]:
sql_query = ''' SELECT *
                FROM salaries
                LIMIT 3
                ;'''

pd.read_sql_query(sql_query, cnx)

   yearid teamid lgid   playerid     salary
0    1985    BAL   AL  murraed02  1472819.0
1    1985    BAL   AL   lynnfr01  1090000.0
2    1985    BAL   AL  ripkeca01   800000.0

In [403]:
sql_query = ''' SELECT *
                FROM salaries as s
                LEFT JOIN master as m 
                    ON s.playerid = m.playerid
                LIMIT 3
                ;'''

pd.read_sql_query(sql_query, cnx)

,yearid,teamid,lgid,playerid,salary,playerid,namefirst,namelast,debut,finalgame
0,1985,BAL,AL,murraed02,1472819.0,murraed02,Eddie,Murray,1977-04-07,1997-09-20
1,1985,BAL,AL,lynnfr01,1090000.0,lynnfr01,Fred,Lynn,1974-09-05,1990-10-03
2,1985,BAL,AL,ripkeca01,800000.0,ripkeca01,Cal,Ripken,1981-08-10,2001-10-06

In [404]:
sql_query2 = ''' SELECT *
                FROM master as m
                LEFT JOIN salaries as s
                    ON m.playerid = s.playerid
                LIMIT 3
                ;'''
pd.read_sql_query(sql_query2, cnx)

,playerid,namefirst,namelast,debut,finalgame,yearid,teamid,lgid,playerid,salary
0,aardsda01,David,Aardsma,2004-04-06,2013-09-28,2004,SFN,NL,aardsda01,300000.0
1,aardsda01,David,Aardsma,2004-04-06,2013-09-28,2007,CHA,AL,aardsda01,387500.0
2,aardsda01,David,Aardsma,2004-04-06,2013-09-28,2008,BOS,AL,aardsda01,403250.0

### The only difference is the table in LEFT JOIN {table} is appended to the RIGHT side of the first table.

In [7]:
server.close()

# Soccer Questions - Part iii

In [1]:
import sqlite3
import pprint
import pandas as pd

In [2]:
pd.set_option("display.max_columns",999)

In [3]:
db = sqlite3.connect('soccerdb.sqlite')

In [407]:
c = db.cursor()
c.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(c.fetchall())

[('sqlite_sequence',), ('Player_Attributes',), ('Player',), ('Match',), ('League',), ('Country',), ('Team',), ('Team_Attributes',)]

In [408]:
#list((c.execute("SELECT * FROM Player LIMIT 5")))

1. Which team scored the most points when playing at home?

In [409]:
sqlquery = '''  SELECT SUM(home_team_goal) AS goals, team_long_name AS team
                FROM Match AS m
                JOIN Team AS t
                On t.team_api_id = m.home_team_api_id
                GROUP BY team
                ORDER BY goals DESC
                LIMIT 1;'''
            
pd.read_sql(sqlquery, db)

   goals            team
0    505  Real Madrid CF

2. Did this team also score the most points when playing away?

In [8]:
sqlquery = '''  SELECT SUM(away_team_goal) AS goals, team_long_name AS team
                FROM Match AS m
                JOIN Team AS t
                On t.team_api_id = m.away_team_api_id
                GROUP BY team
                ORDER BY goals DESC
                LIMIT 1;'''
            
pd.read_sql(sqlquery, db)

   goals          team
0    354  FC Barcelona

3. How many matches resulted in a tie?

In [9]:
sqlquery = '''  SELECT COUNT() AS Draws
                FROM Match
                WHERE home_team_goal=away_team_goal;'''
            
pd.read_sql(sqlquery, db)

   Draws
0   6596

4. How many players have Smith for their last name? How many have 'smith' anywhere in their name?

In [411]:
# Smith for last name
sqlquery = '''  SELECT COUNT(player_name) AS "# Smith Last Name"
                FROM Player
                WHERE player_name LIKE '%smith';
                '''
            
pd.read_sql(sqlquery, db)

   # Smith Last Name
0                 18

In [413]:
# Smith anywhere in name
sqlquery = '''  SELECT COUNT(player_name) AS "# Smith Anywhere"
                FROM Player
                WHERE player_name LIKE '%smith%';
                '''
            
pd.read_sql(sqlquery, db)

   # Smith Anywhere
0                18

5. What was the median tie score? Use the value determined in the previous question for the number of tie games. *Hint:* PostgreSQL does not have a median function. Instead, think about the steps required to calculate a median and use the [`WITH`](https://www.postgresql.org/docs/8.4/static/queries-with.html) command to store stepwise results as a table and then operate on these results.

In [12]:
# a median is the middle result when results are listed in 
# in order by ASC or DECS

# There are 6596 draws
# So I want the 3298 RESULT from all the 0-0, 1-1, 2-2, 3-3, etc

In [14]:
sqlquery = '''  WITH num_draws AS
                       (SELECT Count() AS Draws
                       FROM Match
                       WHERE home_team_goal=away_team_goal),
                     last_is_median AS
                       (SELECT home_team_goal, away_team_goal
                       FROM Match
                       WHERE home_team_goal=away_team_goal
                       ORDER BY home_team_goal
                       LIMIT(SELECT * FROM num_draws)/2)
                SELECT last_is_median.home_team_goal, last_is_median.away_team_goal
                FROM last_is_median
                ORDER BY last_is_median.home_team_goal DESC
                LIMIT 1;
                '''
            
pd.read_sql(sqlquery, db)

   home_team_goal  away_team_goal
0               1               1

6. What percentage of players prefer their left or right foot? *Hint:* Calculate either the right or left foot, whichever is easier based on how you setup the problem.

In [414]:
# It appears some players prefer different feet at different points in time.
# This query returns each of their "apperances" in the table as a different player.
# Thus 24.31% of player "snapshots" have players preferring left feet.

sqlquery = '''
    SELECT COUNT(player_fifa_api_id) * 100.0 / (SELECT COUNT(player_fifa_api_id) FROM Player_Attributes) AS PercentLeft
    FROM Player_Attributes
    WHERE preferred_foot = 'left';   
            '''
pd.read_sql(sqlquery, db)

   PercentLeft
0     24.31432

2018-10-23 16:40:50,399| ERROR   | Socket exception: Connection reset by peer (104)
ERROR:paramiko.transport:Socket exception: Connection reset by peer (104)

# Tennis Questions - Part iv

#### import and setup

In [94]:
from sshtunnel import SSHTunnelForwarder
import pandas as pd

AWS_IP_ADDRESS = '54.245.34.41'
AWS_USERNAME = 'spencer'
SSH_KEY_PATH = '/home/spencer/.ssh/id_rsa'

server = SSHTunnelForwarder(
    AWS_IP_ADDRESS,
    ssh_username=AWS_USERNAME,
    ssh_pkey=SSH_KEY_PATH,
    remote_bind_address=('localhost', 5432),
)

server.start()
print(server.is_active, server.is_alive, server.local_bind_port)

True True 41977

In [95]:
from sqlalchemy import create_engine

# Postgres username, password, and database name
POSTGRES_IP_ADDRESS = 'localhost' ## This is localhost because SSH tunnel is active
POSTGRES_PORT = str(server.local_bind_port)
POSTGRES_USERNAME = 'spencer'     ## CHANGE THIS TO YOUR POSTGRES USERNAME
POSTGRES_PASSWORD = 'spencer' ## CHANGE THIS TO YOUR POSTGRES PASSWORD
POSTGRES_DBNAME = 'tennis'

# A long string that contains the necessary Postgres login information
postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
                .format(username=POSTGRES_USERNAME, 
                        password=POSTGRES_PASSWORD,
                        ipaddress=POSTGRES_IP_ADDRESS,
                        port=POSTGRES_PORT,
                        dbname=POSTGRES_DBNAME))

# Create the connection
tennis_cnx = create_engine(postgres_str)

In [96]:
tennis_cnx

Engine(postgresql://spencer:***@localhost:41977/tennis)

The challenges!

This challenge uses only SQL queries. Please submit answers in a markdown file.

*Hint:* `SUM(double_faults)` sums the contents of an entire column. For each row, to add the field values from two columns, the syntax `SELECT name, double_faults + unforced_errors` can be used.


*Special bonus hint:* To be careful about handling possible ties, consider using [rank functions](http://www.sql-tutorial.ru/en/book_rank_dense_rank_functions.html).

#### Combine all tables into a single table to make queries much simpler

In [98]:
sqlquery = '''
CREATE TABLE ruler AS

SELECT  player2
          AS name,
     'M' AS gender,
     'US' AS tournament,
     result AS win,
     FSP_1 AS fsp,
     DBF_1 AS dbf,
     UFE_1 AS ufe
FROM    us_men_2013

UNION ALL

SELECT  player2
          AS name,
     'M' AS gender,
     'US' AS tournament,
     1-result AS win,
     FSP_2 AS fsp,
     DBF_2 AS dbf,
     UFE_2 AS ufe
FROM    us_men_2013

UNION ALL

SELECT  player1
          AS name,
     'M' AS gender,
     'AUS' AS tournament,
     result AS win,
     FSP_1 AS fsp,
     DBF_1 AS dbf,
     UFE_1 AS ufe
FROM    aus_men_2013

UNION ALL

SELECT  player2
          AS name,
     'M' AS gender,
     'AUS' AS tournament,
     1-result AS win,
     FSP_2 AS fsp,
     DBF_2 AS dbf,
     UFE_2 AS ufe
FROM    aus_men_2013

UNION ALL

SELECT  player1
          AS name,
     'M' AS gender,
     'French' AS tournament,
     result AS win,
     FSP_1 AS fsp,
     DBF_1 AS dbf,
     UFE_1 AS ufe
FROM    french_men_2013

UNION ALL

SELECT  player2
          AS name,
     'M' AS gender,
     'French' AS tournament,
     1-result AS win,
     FSP_2 AS fsp,
     DBF_2 AS dbf,
     UFE_2 AS ufe
FROM    french_men_2013

UNION ALL

SELECT  REPLACE(player1, 
                SUBSTRING(player1 FROM 0 FOR POSITION('.' IN player1)),
                SUBSTRING(player1 FROM 1 FOR 1))
          AS name,
     'M' AS gender,
     'wimbledon' AS tournament,
     result AS win,
     FSP_1 AS fsp,
     DBF_1 AS dbf,
     UFE_1 AS ufe
FROM    wim_men_2013

UNION ALL

SELECT  REPLACE(player1, 
                SUBSTRING(player1 FROM 0 FOR POSITION('.' IN player1)),
                SUBSTRING(player1 FROM 1 FOR 1))
          AS name,
     'M' AS gender,
     'wimbledon' AS tournament,
     1-result AS win,
     FSP_2 AS fsp,
     DBF_2 AS dbf,
     UFE_2 AS ufe
FROM    wim_men_2013

UNION ALL

SELECT  REPLACE(player1, 
                SUBSTRING(player1 FROM 0 FOR POSITION('.' IN player1)),
                SUBSTRING(player1 FROM 1 FOR 1))
          AS name,
     'F' AS gender,
     'wimbledon' AS tournament,
     result AS win,
     FSP_1 AS fsp,
     DBF_1 AS dbf,
     UFE_1 AS ufe
FROM    wim_women_2013

UNION ALL

SELECT  REPLACE(player2, 
                SUBSTRING(player2 FROM 0 FOR POSITION('.' IN player2)),
                SUBSTRING(player2 FROM 1 FOR 1))
          AS name,
     'F' AS gender,
     'wimbledon' AS tournament,
     1-result AS win,
     FSP_2 AS fsp,
     DBF_2 AS dbf,
     UFE_2 AS ufe
FROM    wim_women_2013

UNION ALL

SELECT  player1
          AS name,
     'F' AS gender,
     'French' AS tournament,
     result AS win,
     FSP_1 AS fsp,
     DBF_1 AS dbf,
     UFE_1 AS ufe
FROM    french_women_2013

UNION ALL

SELECT  player2
          AS name,
     'F' AS gender,
     'French' AS tournament,
     1-result AS win,
     FSP_2 AS fsp,
     DBF_2 AS dbf,
     UFE_2 AS ufe
FROM    french_women_2013

UNION ALL

SELECT  player1
          AS name,
     'F' AS gender,
     'AUS' AS tournament,
     result AS win,
     FSP_1 AS fsp,
     DBF_1 AS dbf,
     UFE_1 AS ufe
FROM    aus_women_2013

UNION ALL

SELECT  player2
          AS name,
     'F' AS gender,
     'AUS' AS tournament,
     1-result AS win,
     FSP_2 AS fsp,
     DBF_2 AS dbf,
     UFE_2 AS ufe
FROM    aus_women_2013

UNION ALL

SELECT  player1
          AS name,
     'F' AS gender,
     'US' AS tournament,
     result AS win,
     FSP_1 AS fsp,
     DBF_1 AS dbf,
     UFE_1 AS ufe
FROM    us_women_2013

UNION ALL

SELECT  player2
          AS name,
     'F' AS gender,
     'US' AS tournament,
     1-result AS win,
     FSP_2 AS fsp,
     DBF_2 AS dbf,
     UFE_2 AS ufe
FROM    us_women_2013;
         '''
pd.read_sql(sqlquery, tennis_cnx)

ResourceClosedError: This result object does not return rows. It has been closed automatically.

#### 1. Using the same tennis data, find the number of matches played by each player in each tournament. (Remember that a player can be present as both player1 or player2).

In [82]:
sqlquery = '''  SELECT name,
                    sum(CASE WHEN tournament = 'US' THEN 1 ELSE 0 END) as US, 
                    sum(CASE WHEN tournament = 'AUS' THEN 1 ELSE 0 END) as AUS,
                    sum(CASE WHEN tournament = 'wimbledon' THEN 1 ELSE 0 END) as WIM,
                    sum(CASE WHEN tournament = 'French' THEN 1 ELSE 0 END) as FRENCH,
                    count(tournament) as TOTAL
                FROM master
                GROUP BY name
                ORDER BY total DESC
                LIMIT 5;
                '''
pd.read_sql(sqlquery, tennis_cnx)

                 name  us  aus  wim  french  total
0        Rafael Nadal   7    7    0       7     21
1        David Ferrer   5    5    0       7     17
2      Novak Djokovic   6    5    0       6     17
3  Stanislas Wawrinka   6    6    0       5     17
4       Roger Federer   4    6    0       5     15

#### 2. Who has played the most matches total in all of US Open, AUST Open, French Open? Answer this both for men and women.

In [139]:
sqlquery = '''  SELECT  name AS male,
                        sum(CASE WHEN tournament = 'US' OR tournament = 'AUS' OR tournament = 'French' THEN 1 ELSE 0 END) AS usausfrench_matches
                FROM master
                WHERE gender LIKE 'M'                
                GROUP BY name
                ORDER BY usausfrench_matches DESC
                LIMIT 1;
                '''
pd.read_sql(sqlquery, tennis_cnx)

           male  usausfrench_matches
0  Rafael Nadal                   21

In [140]:
sqlquery = '''  SELECT  name AS female,
                        sum(CASE WHEN tournament = 'US' OR tournament = 'AUS' OR tournament = 'French' THEN 1 ELSE 0 END) AS usausfrench_matches
                FROM master
                WHERE gender LIKE 'F'                
                GROUP BY name
                ORDER BY usausfrench_matches DESC
                LIMIT 4;
                '''
pd.read_sql(sqlquery, tennis_cnx)

                female  usausfrench_matches
0      Maria Sharapova                   11
1  Agnieszka Radwanska                   11
2    Victoria Azarenka                   11
3      Serena Williams                   11

#### 3. Who has the highest first serve percentage? (Just the maximum value in a single match.)

In [147]:
sqlquery = '''  SELECT name, fsp
                FROM master
                ORDER BY fsp desc
                LIMIT 1;
                '''
pd.read_sql(sqlquery, tennis_cnx)

       name   fsp
0  S Errani  93.0

#### 4. What are the unforced error percentages of the top three players with the most wins? (Unforced error percentage is % of points lostdue to unforced errors. In a match, you have fields for number of points won by each player, and number of unforced errors for each field.)

In [150]:
sqlquery = '''  SELECT *
                FROM master
                LIMIT 3;
                '''
pd.read_sql(sqlquery, tennis_cnx)

                 name gender tournament  win   fsp  dbf   ufe
0     Richard Gasquet      M         US    1  63.0    7  None
1     Stephane Robert      M         US    1  61.0    2  None
2  Jan-Lennard Struff      M         US    0  55.0   13  None

In [157]:
sqlquery = '''  SELECT name, COUNT(win) as wins, AVG(ufe) as average_ufe
                FROM master
                where ufe > 1
                group by name
                order by wins desc
                LIMIT 3;
                '''
pd.read_sql(sqlquery, tennis_cnx)

                  name  wins  average_ufe
0         Rafael Nadal    14    27.142857
1         David Ferrer    12    29.083333
2  Agnieszka Radwanska    11    16.272727

## Practice Area to work on string cleaning in SQL

In [99]:
sqlquery = '''  SELECT REPLACE( player1, 
                                SUBSTRING(player1 FROM 0 FOR POSITION('.' IN player1)),
                                SUBSTRING(player1 FROM 1 FOR 1))
                
                , player1, player2
                FROM wim_women_2013
                WHERE player2 LIKE '%%Williams%%' OR player1 LIKE '%%Williams%%';
                '''
pd.read_sql(sqlquery, tennis_cnx)

      replace     player1       player2
0  S.Williams  S.Williams     M.Minella
1  S.Williams  S.Williams      C.Garcia
2  S.Williams  S.Williams  K.Date-Krumm
3  S.Williams  S.Williams     S.Lisicki

In [27]:
sqlquery = '''  SELECT player1, player2
                FROM wim_women_2013
                WHERE player1 LIKE '%%Williams' OR player2 LIKE '%%Williams'
                LIMIT 10;
                '''
pd.read_sql(sqlquery, tennis_cnx)

      player1       player2
0  S.Williams     M.Minella
1  S.Williams      C.Garcia
2  S.Williams  K.Date-Krumm
3  S.Williams     S.Lisicki

In [9]:
sqlquery = '''  SELECT *
                FROM us_women_2013
                WHERE player1 LIKE '%%Williams' OR player2 LIKE '%%Williams'
                LIMIT 15;
                '''
pd.read_sql(sqlquery, tennis_cnx)

,player1,player2,round,result,fnl1,fnl2,fsp_1,fsw_1,ssp_1,ssw_1,...,bpc_2,bpw_2,npa_2,npw_2,tpw_2,st1_2,st2_2,st3_2,st4_2,st5_2
0,S Williams,V Azarenka,7,1,2.0,1.0,57.0,44.0,43.0,20.0,...,8,4,15,10,None,5,7,1.0,None,None
1,S Williams,N Li,6,1,2.0,0.0,63.0,26.0,37.0,9.0,...,4,1,19,13,None,0,3,NaN,None,None
2,S Williams,S Stephens,4,1,2.0,0.0,62.0,26.0,38.0,11.0,...,2,1,12,6,None,4,1,NaN,None,None
3,S Williams,Y Shvedova,3,1,2.0,0.0,66.0,28.0,44.0,7.0,...,1,0,13,4,None,3,1,NaN,None,None
4,S Williams,G Voskoboeva,2,1,2.0,0.0,64.0,21.0,36.0,11.0,...,1,0,10,5,None,3,0,NaN,None,None
5,V Williams,J Zheng,2,0,1.0,2.0,52.0,39.0,48.0,26.0,...,13,4,16,11,None,6,2,7.0,None,None
6,K Flipkens,V Williams,1,0,0.0,2.0,46.0,15.0,54.0,7.0,...,12,6,22,15,None,6,6,NaN,None,None
7,S Williams,F Schiavone,1,1,2.0,0.0,51.0,13.0,49.0,12.0,...,0,0,6,3,None,0,1,NaN,None,None

In [108]:
sqlquery = '''  SELECT *
                FROM wim_men_2013
                WHERE player2 LIKE '%%Lu%%' OR player1 LIKE '%%Lu%%';
                '''
pd.read_sql(sqlquery, tennis_cnx)

,player1,player2,round,result,fnl1,fnl2,fsp_1,fsw_1,ssp_1,ssw_1,...,bpc_2,bpw_2,npa_2,npw_2,tpw_2,st1_2,st2_2,st3_2,st4_2,st5_2
0,J.Ward,Y-H.Lu,1,0,1.0,3.0,62.0,77.0,38.0,35.0,...,15,2,46,39,None,6,6,7,7.0,None
1,Y-H.Lu,A.Murray,2,0,0.0,3.0,66.0,49.0,34.0,13.0,...,15,4,23,19,None,6,6,7,NaN,None

In [167]:
sqlquery = '''  SELECT player1, player2
                FROM us_men_2013
                WHERE player2 LIKE '%%Yen%%' OR player1 LIKE '%%Yen%%';
                '''
pd.read_sql(sqlquery, tennis_cnx)

       player1               player2
0  Yen-Hsun Lu  Daniel Gimeno-Traver
1   Tommy Haas           Yen-Hsun Lu

In [103]:
sqlquery = '''  SELECT player1, player2
                FROM french_women_2013
                WHERE player2 LIKE '%%Suarez%%' OR player1 LIKE '%%Yen%%';
                '''
pd.read_sql(sqlquery, tennis_cnx)

         player1               player2
0   Simona Halep  Carla Suarez Navarro
1  Shelby Rogers  Carla Suarez Navarro
2    Monica Puig  Carla Suarez Navarro

In [101]:
sqlquery = '''  SELECT REPLACE( player1, 
                                SUBSTRING(player1 FROM 0 FOR POSITION('.' IN player1)),
                                SUBSTRING(player1 FROM 1 FOR 1))
                
                , player1, player2
                FROM wim_women_2013
                limit 20;
                '''
pd.read_sql(sqlquery, tennis_cnx)

               replace             player1           player2
0            M.Koehler           M.Koehler        V.Azarenka
1           E.Baltacha          E.Baltacha        F.Pennetta
2              S.Hsieh           S-W.Hsieh           T.Maria
3             A.Cornet            A.Cornet            V.King
4         Y.Putintseva        Y.Putintseva        K.Flipkens
5        A.Tomljanovic       A.Tomljanovic      B.Jovanovski
6          Y.Wickmayer         Y.Wickmayer          V.Dolonc
7           J.Jankovic          J.Jankovic           J.Konta
8            V.Razzano           V.Razzano        A.Ivanovic
9           E.Bouchard          E.Bouchard      G.Voskoboeva
10         S.Arvidsson         S.Arvidsson    M.Lucic-Baroni
11    C.Suarez Navarro    C.Suarez Navarro  L.Dominguez Lino
12           J.Larsson           J.Larsson        E.Makarova
13          G.Muguruza          G.Muguruza      A.Keothavong
14           K.Bertens           K.Bertens        Y.Shvedova
15           P.Kvitova           P.Kvitova      C.Vandeweghe
16        K.Mladenovic        K.Mladenovic       M.Sharapova
17  M.Larcher De Brito  M.Larcher De Brito           M.Oudin
18          L.Hradecka          L.Hradecka           K.Knapp
19          L.Safarova          L.Safarova           L.Davis

In [93]:
np.array()

TypeError: Required argument 'object' (pos 1) not found